app/Controllers/ProductController.php

INSERT INTO `products` (`name`, `category`, `price`, `stock`, `description`) VALUES ('test', 'test', '55', '55', 'tedtg')
---
    public function store()
    {
        $model = new ProductModel();

        $data = [
            'name'        => $this->request->getPost('name'),
            'category'    => $this->request->getPost('category'),
            'price'       => $this->request->getPost('price'),
            'stock'       => $this->request->getPost('stock'),
            'description' => $this->request->getPost('description')
        ];

        // 🔥 Validation check
        if (!$model->insert($data)) {

SELECT *
FROM `products`
---
    public function index()
    {
        $model = new ProductModel();

        $data['products'] = $model->findAll();

DELETE FROM `products`
WHERE `id` IN ('5')
---
    public function ajaxDelete()
    {
        $id = $this->request->getPost('id');
        (new ProductModel())->delete($id);