app/Controllers/StudentController.php

SELECT *
FROM `students`
---
    public function index()
    {
        $model = new StudentModel();

        $data['students'] = $model->findAll(); // get all data